InformationRegisters/ЭТ_КомиссияТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЭТ_КомиссияТО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МетодРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭТ_КомиссияТО_МетодРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорТО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЭТ_КомиссияТО_ПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЭТ_КомиссияТО_ПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭТ_КомиссияТО_МетодРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фиксированная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЭТ_КомиссияТО_МетодРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЭТ_КомиссияТО_МетодРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоговорРеализации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фиксированная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЭТ_КомиссияТО/Ext/ManagerModule.bsl
Функция ПолучитьКомиссиюТОПоДоговору(Договор) Экспорт
	КВозврату = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭТ_КомиссияТО.ДоговорТО КАК ДоговорТО,
		|	ЭТ_КомиссияТО.СуммаКомиссии КАК СуммаКомиссии
		|ИЗ
		|	РегистрСведений.ЭТ_КомиссияТО КАК ЭТ_КомиссияТО
		|ГДЕ
		|	ЭТ_КомиссияТО.ДоговорТО = &ДоговорТО";
	
	Запрос.УстановитьПараметр("ДоговорТО", Договор);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КВозврату = ВыборкаДетальныеЗаписи.СуммаКомиссии;
	КонецЦикла;
	Возврат  КВозврату;     
КонецФункции

Функция ПолучитьСуммуКомиссииТО(Договор,Сумма,КомиссияВходитВСумму=Ложь) Экспорт
	КВозврату = Новый Структура("Договор,СуммаНоменклатуры,СуммаКомиссии,Сообщение,Ошибки");
	КВозврату.Договор = Договор;
	КВозврату.Ошибки = Истина;
	КВозврату.Сообщение = "Данные комиссии ТО не определены.";
	КВозврату.СуммаНоменклатуры = Сумма;
	КВозврату.СуммаКомиссии = 0;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭТ_КомиссияТО.ДоговорТО КАК ДоговорТО,
		|	ЭТ_КомиссияТО.СуммаКомиссии КАК СуммаКомиссии
		|ИЗ
		|	РегистрСведений.ЭТ_КомиссияТО КАК ЭТ_КомиссияТО
		|ГДЕ
		|	ЭТ_КомиссияТО.ДоговорТО = &ДоговорТО";
	
	Запрос.УстановитьПараметр("ДоговорТО", Договор);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КВозврату.СуммаКомиссии = ВыборкаДетальныеЗаписи.СуммаКомиссии;		
		Если КомиссияВходитВСумму Тогда
			КВозврату.СуммаНоменклатуры = Сумма-КВозврату.СуммаКомиссии;
		Иначе
			КВозврату.СуммаНоменклатуры = Сумма;
		КонецЕсли;
		КВозврату.Ошибки = Ложь;
		КВозврату.Сообщение = "Данные комиссии по договору "+Договор.Наименование+" определены в платежном поручении.";
		Возврат  КВозврату;
	КонецЦикла;

	ЗначениеПоУмолчанию = РегистрыСведений.ЭТ_КомиссияТО_ПоУмолчанию.ПолучитьКомиссиюТОПоУмолчанию(Договор.Организация, Договор.Владелец);
	Если ЗначениеПоУмолчанию.Ошибки = Истина Тогда
		КВозврату.Сообщение = КВозврату.Сообщение + " " + ЗначениеПоУмолчанию.Сообщение;
		Возврат  КВозврату;     
	Иначе                                                
		Если ЗначениеПоУмолчанию.МетодРасчета = Перечисления.ЭТ_КомиссияТО_МетодРасчета.Фиксированная Тогда
			КВозврату.СуммаКомиссии = ЗначениеПоУмолчанию.Фиксированная;						
		ИначеЕсли ЗначениеПоУмолчанию.МетодРасчета = Перечисления.ЭТ_КомиссияТО_МетодРасчета.Процент Тогда
			КВозврату.СуммаКомиссии = Сумма * ЗначениеПоУмолчанию.Процент / 100;						
		ИначеЕсли ЗначениеПоУмолчанию.МетодРасчета = Перечисления.ЭТ_КомиссияТО_МетодРасчета.ДоговорРеализации Тогда
			КВозврату.СуммаКомиссии = 0;									
		КонецЕсли;		               
		
		Если КомиссияВходитВСумму Тогда
			КВозврату.СуммаНоменклатуры = Сумма-КВозврату.СуммаКомиссии;
		Иначе
			КВозврату.СуммаНоменклатуры = Сумма;
		КонецЕсли;
	КонецЕсли;		
	КВозврату.Сообщение = "Данные комиссии партнера "+Договор.Владелец.Наименование+" ("+Договор.Владелец.ИНН+")"+" определены в карточке партнера.";
	КВозврату.Ошибки = Ложь;		
	
	Возврат  КВозврату;     
КонецФункции
